# RecalculateWS

## Description
Recalculates all formulas for the referenced worksheet.

```pascal
PROCEDURE RecalculateWS(worksheet : HANDLE);
```

```python

def vs.RecalculateWS(worksheet):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|worksheet|HANDLE|Handle to worksheet.|

## Version
Availability: from VectorWorks9.0
## Category
* Worksheets